{
  "cursos": [
    {
      "id": 1,
      "name": "Python",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/Z2Bvc1q/Design-sem-nome-3.png",
      "foto2": "https://i.ibb.co/27KL0wc/Cards-04.png",
      "descricao1": "Nesse curso você irá se aprofundar em uma das linguagens mais utilizadas em Ciência de Dados, o Python. Irá explorar da instalação à seus princípios e funções, aprenderá a utilizar a linguagem em aplicações de dados. ",
      "descricao2": "Esse é um curso para quem busca aprender programação na linguagem Python, e que tem pouca ou nenhuma experiência com lógica de programação, algoritmos, programação orientada à objetos, banco de dados ou páginas para internet.",
      "descricao3": "Aprendendo desenvolver programas com Python, seu perfil profissional terá muito mais chances de sucesso como programador, independente do seu nível de conhecimento.",
      "preco": "150.00",
      "favorito": true
    },
    {
      "id": 2,
      "name": "Javascript",
      "description": "Crie páginas dinâmicas",
      "foto": "https://i.ibb.co/mR1FWst/js.png",
      "foto2": "https://i.ibb.co/FxtVpD9/js-detalhes.png",
      "descricao1": "Neste curso você irá aprender tudo que é necessário para dominar o JavaScript. O curso vai do básico ao avançado e ao final dele você terá uma compreensão total da linguagem, dos seus principais métodos e da sua sintaxe.",
      "descricao2": "O foco é no aprendizado da linguagem, mas o principal local de aplicação será na web, através de manipulações do DOM e requisições via Fetch API.",
      "descricao3": "Esse não é um curso para quem deseja algo rápido, mas sim para quem deseja dominar a linguagem. O código ensinado utiliza todas as novidades das novas versões de JavaScript, como arrow functions, promises e mais.",
      "preco": " 220.79",
      "favorito": true
    },
    {
      "id": 3,
      "name": "Angular",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/bgXWQXF/angular.png",
      "foto2": "https://i.ibb.co/svHGv1n/Cards-03.png",
      "descricao1": "Nesse curso vamos aprender como desenvolver com Angular e TypeScript. Você vai aprender os conceitos básicos e intermediários do Angular, desde os primeiros passos até uma aplicação completa com requisições ao servidor e rotas.",
      "descricao2": "Vamos aprender os conceitos de componentes, templates, diretivas, serviços, data-binding, validação de formulários, formulários reativos, roteamento (single page application – SPA) e como conectar ao servidor e trabalhar com RxJS (Observables).",
      "descricao3": "Não é necessário saber AngularJS para esse curso, já que o Angular foi reescrito. Vamos aprender todos os conceitos do zero, então não se preocupe!",
      "preco": "180.00",
      "favorito": true
    },
    {
      "id": 4,
      "name": "I.A. - ChatGpt",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/zHpBqpG/gpt.png",
      "foto2": "https://i.ibb.co/SVxcWJG/Cards-11.png",
      "descricao1": "O curso tem como público-alvo quem quer aprender a usar as mais recentes tecnologias de inteligência artificial para melhorar o seu trabalho e seus projetos.",
      "descricao2": "Crie e adapte textos com auxílio de inteligência artificial, gere imagens a partir de descrições textuais",
      "descricao3": "Utilize ChatGPT para melhorar a qualidade do seu texto. E entenda como aproveitar ao máximo as tecnologias de inteligência artificial.",
      "preco": "85.90",
      "favorito": false
    },
    {
      "id": 5,
      "name": "TypeScript",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/R7zNyXP/Design-sem-nome-4.png",
      "foto2": "https://i.ibb.co/sKn0f9B/Cards-06.png",
      "descricao1": "Neste curso você irá aprender a como utilizar o TypeScript do zero.",
      "descricao2": "Você irá aprender a manipular dados, criar interfaces, utilizar safe guards, definir o tipo correto de um dado e mais.",
      "descricao3": " O foco do curso é no TypeScript puro e ao final dele você sairá sabendo muito mais como o JavaScript funciona.",
      "preco": "59.90",
      "favorito": true
    },
    {
      "id": 6,
      "name": "HTML e CSS",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/cbHkgKn/8.png",
      "foto2": "https://i.ibb.co/hWXhhCK/Cards-08.png",
      "descricao1": "Este curso é para quem deseja entrar ou já está no mercado e desenvolvimento Front End/criação de sites.",
      "descricao2": "Se você está iniciando, terá a oportunidade de aprender do zero e para os que já trabalham com web design/front end é uma boa oportunidade para se atualizar/aprender uma abordagem diferente.",
      "descricao3": "Foco na teoria + prática, assim você aprende os fundamentos por trás de cada decisão de código. E após isso você implementa em um projeto real — bikcraft.com. Você já sai do curso com um primeiro site profissional construído. Nele eu uso CSS Flexbox e Grid Layout para construir os projetos responsivos e totalmente do zero, sem usar nada pronto.",
      "preco": "250.00",
      "favorito": false
    },
    {
      "id": 7,
      "name": "Q.A",
      "description": "Plano de Testes",
      "foto": "https://i.ibb.co/BKmbfZy/5.png",
      "foto2": "https://i.ibb.co/zxhGbzJ/Cards-12.png",
      "descricao1": "Com Quality Assurance você irá criar um plano de teste, criar documento de planejamento de teste de software, aprender o que são testes, como modelá-los e executá-los. Saiba encontrar e reportar defeitos em sistemas",
      "descricao2": "Descubra o papel do profissional de qualidade de software em um time de desenvolvimento. Entenda o que são cenários e casos de teste. Aprenda como metrificar a qualidade do seu software ",
      "descricao3": "Se você está iniciando na área de testes, ou quer começar, esta formação é para você! Nela vamos te mostrar o que uma pessoa QA faz no dia a dia, como montar um planejamento de testes, o que testar e quais os tipos de testes existentes, vamos te dar exemplos do mundo real e te inserir no universo da qualidade!",
      "preco": "185.90",
      "favorito": false
    },
    {
      "id": 8,
      "name": "Banco SQL",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/hZmRCzh/sql.png",
      "foto2": "https://i.ibb.co/7gbC4nZ/Cards-05.png",
      "descricao1": "Neste curso você aprenderá as noções centrais de bancos de dados relacionais, que são implementados por empresas para que possam tomar decisões com base nas informações que geram em seus modelos de negócio.",
      "descricao2": "Você criará um banco de dados relacional do zero, começando com a geração da estrutura, até a inserção das informações e implementação de processos de automação para a manutenção da base.",
      "descricao3": "Você implementará consultas SQL avançadas para gerar relatórios para tomadas de decisão. No final do curso você estará pronto para analisar bancos de dados e informações de qualquer modelo de negócio.",
      "preco": "290.00",
      "favorito": false
    },
    {
      "id": 9,
      "name": "NodeJs",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/rvC0PsT/node.png",
      "foto2": "https://i.ibb.co/nsPSZQ1/Cards-09.png",
      "descricao1": "O Node.JS é uma ferramenta versátil, que pode ser utilizada com diferentes finalidades. Aprenda a importar e utilizar código de repositórios de código aberto. Entenda o que são as promessas e como trabalhar com código assíncrono em Node.js",
      "descricao2": "Escreva suas primeiras expressões regulares e veja como utilizá-las para resolver problemas. Crie seus próprios comandos para serem executados no terminal. Use as bibliotecas mais recentes do Node.js para fazer requisições HTTP e manejar respostas",
      "descricao3": "Você irá aprender do zero, mas aos iniciantes que escolheram o JavaScript para iniciar a aprendizagem em programação e já têm familiaridade com funções, tipos, arrays e objetos será um complemento para desenvolver seus primeiros programas em Node.Js.",
      "preco": "160.00",
      "favorito": false
    },
    {
      "id": 10,
      "name": "Java",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/nzfN0q0/7.png",
      "foto2": "https://i.ibb.co/10tVwqz/Cards-10.png",
      "descricao1": "Java é uma das linguagens de programação mais usadas no mundo. A linguagem é orientada a objetos, multiplataforma e bastante completa por permitir a criação de um programa único para uso em diversas plataformas. ",
      "descricao2": "Neste curso você irá criar um projeto Java com o IntelliJ, aprender sobre o processo de compilação e execução de uma aplicação Java, conhecer os principais tipos de dados, utilizar o Scanner para leitura de dados e ter o controle o fluxo da aplicação com o uso de condicionais e loops.",
      "descricao3": "A formação Java do CodeCreators é um guia de aprendizado completo para você iniciar uma carreira na programação Java. Você vai aprender desde os fundamentos da linguagem com as boas práticas até o conhecimento essencial para uma boa modelagem orientada a objetos.",
      "preco": "230.50",
      "favorito": false
    },
    {
      "id": 11,
      "name": "React",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/sJBTYgH/react-2.png",
      "foto2": "https://i.ibb.co/10f0ybP/Cards-02.png",
      "descricao1": "Neste curso você irá aprender a como utilizar o React do zero para o desenvolvimento de aplicações web reativas.",
      "descricao2": "Você irá aprender a criar um aplicativo web com funcionalidades parecidas de redes sociais como o Instagram.",
      "descricao3": "O foco do curso é no entendimento completo do React, com isso praticamente tudo será criado do zero, sem a dependência de pacotes externos.",
      "preco": "185.90",
      "favorito": false
    },
    {
      "id": 12,
      "name": "Linux",
      "description": "Aprendendo do Zero",
      "foto": "https://i.ibb.co/2vWPfR8/6.png",
      "foto2": "https://i.ibb.co/6sWgT23/Cards-07.png",
      "descricao1": "Conheça o sistema de diretórios do Linux, trabalhe com a linha de comando sem medo, compacte e descompacte seus arquivos e faça edição no console usando o VI",
      "descricao2": "Se você está em busca em  aprender a lidar bem com o Linux este curso foi pensados para facilitar seus estudos",
      "descricao3": "Formação completa para o mercado.",
      "preco": "275.00",
      "favorito": false
    }
  ],
  "contato": [],
  "users": [
    {
      "name": "Vitor",
      "idade": "18 a 23",
      "email": "vitor@teste.com",
      "username": "vitor",
      "confirmUsername": "vitor",
      "password": "admin",
      "confirmPassword": "admin",
      "id": 1,
      "tipo": "admin"
    },
    {
      "name": "mayla",
      "idade": "24 a 30",
      "email": "mayla@mayla.com",
      "username": "mayla",
      "password": "admin",
      "confirmPassword": "admin",
      "tipo": "admin",
      "id": 2
    },
    {
      "name": "Vitor Vargem Julio Barbosa",
      "idade": "18 a 24",
      "email": "vitorvargem27@gmail.com",
      "username": "vitor_vvjb",
      "confirmUsername": "vitor_vvjb",
      "password": "123456",
      "confirmPassword": "123456",
      "tipo": "usuario",
      "id": 3
    }
  ]
}