{
  "cursos": [
    {
      "id": 1,
      "name": "Python",
      "description": "Começando com a linguagem",
      "foto": "https://i.ibb.co/nRX9q0B/Python-logo-notext-svg.png",
      "foto2": "",
      "descricao1": "Aqui, você aprende a usar Python, desde o zero, criando toda a lógica de programação, e entende como funciona o Python e como usar todas as ferramentas dele para resolver qualquer desafio.",
      "descricao2": "É uma linguagem de programação de alto nível e de propósito generalista. Sua filosofia de design enfatiza a legibilidade do código com a proposta de ser de fácil compreensão com o uso de palavras-chave em inglês. Não costuma utilizar recursos gráficos como chaves e colchetes para delimitar blocos.",
      "descricao3": "Dominando tudo que você precisa do Python, você agora pode partir para criar Projetos Completos Reais, do zero até o 'deploy', até a utilização do Projeto na sua empresa. Projetos realmente completos em todas as áreas, seja em Automações de Tarefas e Sistemas, Ciência de Dados, Criação de Sites, Criação de Jogos ou Desenvolvimento de Sites.",
      "preco": "159.80",
      "favorito": true
    },
    {
      "id": 2,
      "name": "Javascript",
      "description": "Crie páginas dinâmicas",
      "foto": "https://i.ibb.co/mR1FWst/js.png",
      "foto2": "https://i.ibb.co/FxtVpD9/js-detalhes.png",
      "descricao1": "Neste curso você irá aprender tudo que é necessário para dominar o JavaScript. O curso vai do básico ao avançado e ao final dele você terá uma compreensão total da linguagem, dos seus principais métodos e da sua sintaxe.",
      "descricao2": "O foco é no aprendizado da linguagem, mas o principal local de aplicação será na web, através de manipulações do DOM e requisições via Fetch API.",
      "descricao3": "Esse não é um curso para quem deseja algo rápido, mas sim para quem deseja dominar a linguagem. O código ensinado utiliza todas as novidades das novas versões de JavaScript, como arrow functions, promises e mais.",
      "preco": "R$ 220.79",
      "favorito": true
    },
    {
      "id": 3,
      "name": "Angular",
      "description": "Construa aplicativos web incríveis",
      "foto": "https://i.ibb.co/bgXWQXF/angular.png",
      "foto2": "",
      "descricao1": "Desenvolva aplicações web modernas, complexas, responsivas e escaláveis com o Angular,e use a compreensão profunda e adquirida dos fundamentos do Angular para se estabelecer rapidamente como um desenvolvedor frontend",
      "descricao2": "Compreenda completamente a arquitetura por trás de um aplicativo Angular e como usá-lo",
      "descricao3": "Crie aplicativos de página única com uma das estruturas JavaScript mais modernas do mercado",
      "preco": "275.20",
      "favorito": false
    },
    {
      "id": 4,
      "name": "I.A./chatGpt",
      "description": "Otimize a construção de um produto digital",
      "foto": "https://i.ibb.co/gS91df9/IA.webp",
      "foto2": "",
      "descricao1": "O curso tem como público-alvo quem quer aprender a usar as mais recentes tecnologias de inteligência artificial para melhorar o seu trabalho e seus projetos.",
      "descricao2": "Crie e adapte textos com auxílio de inteligência artificial, Gere imagens a partir de descrições textuais",
      "descricao3": "Utilize ChatGPT para melhorar a qualidade do seu texto.E entenda como aproveitar ao máximo as tecnologias de inteligência artificial.",
      "preco": "280.15",
      "favorito": true
    },
    {
      "id": 5,
      "name": "TypeScript",
      "description": "TypeScript é projetado para o desenvolvimento de grandes aplicações e transcompilações para JavaScript.",
      "foto": "https://i.ibb.co/wQXsZn5/typescript.png",
      "foto2": "",
      "descricao1": "Neste curso voçê ira aprender tudo que é necessario para aprender mais sobre TypeScript,TypeScript é a adoção da linguagem como padrão em diversos frameworks front-end e permite construir códigos com melhor arquitetura.",
      "descricao2": "Você pode usar uma grande variedade de padrões de design em JavaScript. No entanto, alguns padrões de design dificultam que os tipos sejam inferidos automaticamente (por exemplo, padrões que usam programação dinâmica).",
      "descricao3": " Para cobrir esses casos, o TypeScript oferece suporte a uma extensão da linguagem JavaScript, que oferece locais para você dizer ao TypeScript quais devem ser os tipos.",
      "preco": "195.49",
      "favorito": true
    },
    {
      "id": 6,
      "name": "HTML e CSS",
      "description": "Crie páginas dinâmicas",
      "foto": "https://i.ibb.co/8BV6Y08/HTML-CSS.png",
      "foto2": "",
      "descricao1": "Este curso é para quem deseja entrar ou já está no mercado e desenvolvimento Front End/criação de sites.",
      "descricao2": "Se você está iniciando, terá a oportunidade de aprender do zero e para os que já trabalham com web design/front end é uma boa oportunidade para se atualizar/aprender uma abordagem diferente.",
      "descricao3": "foco na teoria + prática, assim você aprende os fundamentos por trás de cada decisão de código. E após isso você implementa em um projeto real — bikcraft.com. Você já sai do curso com um primeiro site profissional construído. Nele eu uso CSS Flexbox e Grid Layout para construir os projetos responsivos e totalmente do zero, sem usar nada pronto.",
      "preco": "150.00",
      "favorito": false
    },
    {
      "id": 7,
      "name": "QA",
      "description": "Processos e automação de testes",
      "foto": "https://i.ibb.co/7VbPQLY/QA1.png",
      "foto2": "",
      "descricao1": "Dê seus primeiros passos em qualidade de software, conheça os processos e o dia a dia de uma pessoa tester e aprenda automação de testes usando Cypress",
      "descricao2": "Se você está iniciando na área de testes, ou quer começar, esta formação é para você! Nela vamos te mostrar o que uma pessoa QA faz no dia a dia, como montar um planejamento de testes, o que testar e quais os tipos de testes existentes, vamos te dar exemplos do mundo real e te inserir no universo da qualidade!",
      "descricao3": "Para dar um gás na sua carreira, também vamos te ensinar lógica, como usar o Git e como fazer testes usando o Cypress! Se você já é QA mas quer começar a automatizar, essa formação também vai te ajudar a começar com o pé direito!",
      "preco": "184.99",
      "favorito": false
    },
    {
      "id": 8,
      "name": "Banco SQL",
      "description": "Manipule e pesquise dados com um dos bancos de dados mais avançado de código aberto.",
      "foto": "https://i.ibb.co/YdPhMgJ/sql.jpg",
      "foto2": "",
      "descricao1": "A Formação PostgreSQL é um guia de aprendizado com cursos e conteúdos para você dar mais um passo em uma carreira bem sucedida na programação, ciência de dados ou administração de bancos de dados. Você vai aprender desde os fundamentos da linguagem SQL com consultas e manipulações de dados até programação diretamente no banco além de administração e otimização de servidores PostgreSQL.",
      "descricao2": "É um Sistema Gerenciador de Bancos de Dados (SGBD) relacional que permite armazenar, consultar e manipular dados de inúmeras formas. Dentre seus diversos diferenciais está a linguagem PL/pgSQL",
      "descricao3": "E o PL/pgSQL é uma linguagem que possibilita a construção de programas poderosos para empresas que precisam gerenciar tabelas com milhões ou bilhões de registros e, por isso, aprender essa tecnologia facilita o trabalho de quem manipula o SGBD PostgreSQL.",
      "preco": "165.55",
      "favorito": false
    },
    {
      "id": 9,
      "name": "NodeJs",
      "description": "Um ambiente de código-aberto para execução de JavaScript em várias plataformas.",
      "foto": "https://i.ibb.co/m8bqp9N/node1.png",
      "foto2": "",
      "descricao1": "O Node.JS é uma ferramenta versátil, que pode ser utilizada com diferentes finalidades. Apesar disso, na programação, há algumas situações em que se recorre a ele com mais frequência. A primeira delas é a criação de chatbots, em que basta eleger uma única resposta para a requisição feita pelo usuário, o que exige pouco processamento.",
      "descricao2": "Durante os estudos, você poderá criar seu próprio projeto prático com temas reais do mercado para desenvolver suas habilidades de programação e utilizar como portfólio ao final do curso.",
      "descricao3": "",
      "preco": "160.77",
      "favorito": false
    },
    {
      "id": 10,
      "name": "Java",
      "description": "Java é uma linguagem de programação orientada a objetos amplamente utilizada.",
      "foto": "https://i.ibb.co/wYCw4Vz/java-logo.png",
      "foto2": "",
      "descricao1": "Java é uma das linguagens de programação mais usadas no mundo. A linguagem é orientada a objetos, multiplataforma e bastante completa por permitir a criação de um programa único para uso em diversas plataformas. ",
      "descricao2": "A plataforma Java ganhou muitos mercados diferentes - da web ao desktop em grandes empresas e governos, passando por mobile e IoT mas o grande mercado Java hoje ainda é o back-end em sistemas Web.",
      "descricao3": "A formação Java do CodeCreators é um guia de aprendizado completo para você iniciar uma carreira na programação Java. Você vai aprender desde os fundamentos da linguagem com as boas práticas até o conhecimento essencial para uma boa modelagem orientada a objetos.",
      "preco": "230.49",
      "favorito": false
    },
    {
      "id": 11,
      "name": "React",
      "description": "lidando com arquivos estáticos",
      "foto": "https://i.ibb.co/7pMyPLT/React-icon-svg.png",
      "foto2": "",
      "descricao1": "Neste curso irá descobrir o jeito mais moderno de desenvolver aplicações web e sistemas web, você vai aprender a criar aplicações completas do extremo zero e entendendo na prática como o React Js funciona.",
      "descricao2": "O Curso é para qualquer pessoa, desenvolvedores que querem crescer como programadores na área de desenvolvimento web.",
      "descricao3": "Então mesmo que você ainda não saiba nada sobre programação e quer começar na area esse curso aqui também é pra você. Vamos aprender na pratica tudo desde o zero á configurar seu ambiente de trabalho e todo ecossistema, entender oque é o react e por que usamos ele, criar seus primeiros projetos e até aplicações completas.E Temos como objetivo sempre passar boas praticas e métodos que são os mais usados e preparando você seja para o mercado de trabalho, ou apenas para criar seus próprios projetos.",
      "preco": "185.30",
      "favorito": false
    },
    {
      "id": 12,
      "name": "Linux I",
      "description": "conhecendo e utilizando o terminal",
      "foto": "https://i.ibb.co/gFqfNZ8/linux.webp",
      "foto2": "",
      "descricao1": "Nesta formação você dará os primeiros passos com o sistema operacional linux, aprendendo a manipular arquivos e diretórios através da CLI (command-line interface), a gerenciar serviços, vai mergulhar no sistema e acessar logs, processos e dispositivos. E, por fim, vai aprender a administrar os usuários e grupos do sistema.",
      "descricao2": "Guia de aprendizado. Conteúdos pensados para facilitar seu estudo",
      "descricao3": "Formação completa para o mercado, Do zero ao sonhado emprego em sua área de interesse",
      "preco": "275.00",
      "favorito": false
    }
  ],
  "contato": [
    {
      "nome": "mayla",
      "email": "mayla@mayla.com",
      "assunto": "elogio",
      "mensagem": "muito bom, parabens!",
      "id": 1
    },
    {
      "nome": "testando",
      "email": "teste@teste.com",
      "assunto": "elogio",
      "mensagem": "testando denovo",
      "id": 2
    },
    {
      "nome": "testando",
      "email": "teste@teste.com",
      "assunto": "elogio",
      "mensagem": "testando denovo",
      "id": 3
    }
  ],
  "users": [
    {
      "name": "Vitor",
      "idade": "mais de 30",
      "email": "vitor@teste.com",
      "username": "vitorVargem",
      "password": "admin",
      "confirmPassword": "admin",
      "id": 1,
      "tipo": "admin"
    },
    {
      "name": "Vitor Vargem Julio Barbosa",
      "idade": "18 a 24",
      "email": "vitorvargem27@gmail.com",
      "username": "vitor_vvjb",
      "password": "123456",
      "confirmPassword": "123456",
      "tipo": "usuario",
      "id": 2
    }
  ]
}